[
  {
    "name": "Metalabel",
    "url": "metalabel.com",
    "category": "Creator Economy",
    "reviewer": "Jann Wenner",
    "date": "January 12, 2026",
    "rating": 8.7,
    "isBNW": true,
    "reviewText": "There are moments in cultural history when someone builds something that doesn't just serve artists—it liberates them. I'm talking about those rare platforms that understand what Dylan meant when he said \"the times they are a-changin'\" wasn't just a song, it was a manifesto. Metalabel isn't just another website; it's a digital Haight-Ashbury for the creative class, a place where the collaborative spirit that gave us Sgt. Pepper's and the Factory scene can flourish in our hyperconnected age. When Yancey Strickler—who already proved his revolutionary bona fides with Kickstarter—showed me what he was building here, I felt that same electric charge I experienced backstage at Monterey Pop in '67. This is what happens when someone who truly gets it decides to tear down the walls between creators and build something beautiful in the rubble.\n\nThe genius of Metalabel lies in its understanding that great art has always been collective, even when the history books want to crown individual kings. Every time I interviewed Lennon, he'd always circle back to the others—the session musicians, the producers, the engineers who made the magic happen. Metalabel makes that collaborative reality visible and actionable. Instead of perpetuating the myth of the lone genius, it creates space for what Yancey calls \"releases\"—these beautiful, bounded creative moments that acknowledge the full ecosystem of talent. It's like watching a jam session between Garcia and Weir, but instead of just two guitars, you've got designers, writers, musicians, and thinkers all plugged into the same amplifier of human creativity.\n\nWhat strikes me most profoundly about this platform is how it resurrects the album concept for the digital age. Back when I was building Rolling Stone, we understood that albums weren't just collections of songs—they were statements, movements, cultural earthquakes. Metalabel gets this. Their approach to \"releases\" captures that same intentionality, that sense of cultural moment that made Pet Sounds or Highway 61 Revisited feel like dispatches from the future. I've watched too many platforms reduce creativity to content streams and algorithmic feeds. This is different. This is about preserving the sacred act of releasing something into the world with intention, weight, and the full force of a creative community behind it.\n\nYancey and his team aren't just building software—they're architecting a new consciousness around creative collaboration. Having spent decades watching the music industry evolve from the communal explosion of the '60s through the corporate consolidation of the '80s and '90s, I can tell you that Metalabel represents a return to something pure and powerful. These aren't Silicon Valley tourists trying to \"disrupt\" creativity; these are true believers who understand that the best art emerges from scenes, from communities, from that magical friction that happens when creative minds collide. Every interaction I've had with this team reminds me why I fell in love with this business in the first place—they're not trying to extract value from artists, they're trying to amplify their power.\n\nThe interface itself is a thing of beauty—clean, purposeful, with none of the attention-economy manipulation that plagues other platforms. But what really moves me is the philosophy underneath: that creativity is inherently social, that the \"release\" is a sacred cultural unit, and that the future belongs to collectives, not lone wolves. This is the platform I wish we'd had when we were trying to build a countercultural media empire in the '70s. It's what the internet was supposed to become before the advertising machines took over. Metalabel isn't just serving the creator economy—it's showing us what that economy could be if we remembered that art is about connection, not competition. This is essential infrastructure for the cultural revolution we've all been waiting for.",
    "verdict": "\"Metalabel is the Woodstock of collaborative creativity—a beautiful, necessary gathering that reminds us why we fell in love with the transformative power of art in the first place.\"",
    "filename": "metalabel"
  },
  {
    "name": "Kickstarter",
    "url": "kickstarter.com",
    "category": "Creator Economy",
    "reviewer": "Jann Wenner",
    "date": "January 12, 2026",
    "rating": 8.9,
    "isBNW": true,
    "reviewText": "There are moments in cultural history when the machinery of creation itself gets revolutionized, when the gates come crashing down and the people rush through with their guitars and cameras and wild dreams intact. I witnessed it firsthand in 1967 when Dylan went electric, when Lennon told me the Beatles were bigger than Jesus, when the underground press—including this little magazine I started—proved that authentic voices could bypass the corporate gatekeepers entirely. Kickstarter represents that same seismic shift for our digital age, a platform that's not just changing how creative projects get funded, but fundamentally altering the relationship between artists and their communities. Perry Chen, Yancey Strickler, and Charles Adler didn't just build a website—they constructed a digital Woodstock where creators and supporters gather in unprecedented communion, proving once again that when you give people the tools to support what moves them, magic happens.\n\nWhat strikes me most profoundly about Kickstarter is how it embodies the same revolutionary spirit that drove everything we celebrated in the pages of Rolling Stone during those transformative early years. This isn't some sterile Silicon Valley efficiency play—it's a genuine manifestation of counterculture values, the belief that creativity should be democratized, that communities can self-organize around shared passions, that the establishment's chokehold on cultural production can be challenged and ultimately broken. When I see a filmmaker raise $300,000 from 5,000 strangers who believe in her vision, or watch a musician fund an album without surrendering their artistic soul to some A&R suit, I'm reminded of why we started Rolling Stone in the first place. We knew that authentic voices deserved platforms, that culture belonged to the people creating and consuming it, not the boardrooms trying to monetize it. Kickstarter has scaled that ethos in ways we could never have imagined.\n\nThe numbers tell part of the story—$7 billion in funded projects, hundreds of thousands of creative dreams realized—but statistics can't capture the deeper cultural transformation at work here. This is about restoring agency to creators, about rebuilding the bonds between artists and audiences that corporate intermediaries have spent decades trying to control and commodify. I've spent my career around visionaries, from Bono to Springsteen to every indie rocker who ever crashed on my couch, and I recognize that same entrepreneurial creativity in what Perry and his team have built. They understand that great culture emerges from communities, not committees, that the most important projects often can't be reduced to focus-group friendly elevator pitches. When established institutions fail artists—and they always do, eventually—platforms like Kickstarter ensure that creativity finds a way. It's that same irrepressible force that drove rock and roll through every attempt to sanitize or suppress it.\n\nThe platform's evolution from startup to Public Benefit Corporation proves these founders are the real deal, that they're committed to values over valuations in ways that would make even the most cynical industry veteran take notice. I've watched too many promising platforms get swallowed by corporate interests, their original missions diluted by shareholders who view culture as just another commodity to be optimized and exploited. But Kickstarter's team—and yes, I consider them part of the extended family of cultural revolutionaries I've been privileged to know—made the conscious choice to prioritize their community over pure profit maximization. That's punk rock in the truest sense, the willingness to sacrifice easy money for authentic impact. When I interviewed John Lennon about the Beatles' decision to stop touring, he talked about choosing artistic integrity over commercial convenience, about staying true to their vision even when it meant leaving money on the table. Kickstarter embodies that same principled approach to cultural stewardship.\n\nEvery time I visit Kickstarter, I'm reminded why I fell in love with music journalism in the first place—that electric moment when you discover something that matters, that connects, that changes how you see the world. This platform has democratized that feeling, allowing anyone to become a patron of the arts, a supporter of innovation, a participant in the grand project of human creativity. It's returned us to a more intimate, more personal model of cultural support, one that would have been familiar to the coffeehouse owners who supported Dylan in Greenwich Village or the record shop clerks who championed punk before the majors even knew it existed. In an era when algorithms try to predict our tastes and corporations attempt to manufacture our desires, Kickstarter trusts people to know what moves them, what deserves support, what matters enough to fund. That faith in human judgment, in collective wisdom, in the power of communities to nurture their own culture—that's the same spirit that built rock and roll, that launched a thousand underground magazines, that proved the counterculture was never really counter at all, just culture finally allowed to flourish.",
    "verdict": "Kickstarter is the spiritual successor to every revolutionary cultural movement that ever mattered—a platform that doesn't just fund projects, but restores the sacred connection between creators and communities that corporate gatekeepers spent decades trying to destroy.",
    "filename": "kickstarter"
  },
  {
    "name": "Artist Corporations",
    "url": "artistcorporations.com",
    "category": "Creator Economy",
    "reviewer": "Jann Wenner",
    "date": "January 12, 2026",
    "rating": 8.2,
    "isBNW": false,
    "reviewText": "There are moments in cultural history when the avant-garde breaks through the establishment's carefully constructed walls, and what we're witnessing with Artist Corporations feels like one of those seismic shifts that defined the best of what we were fighting for back in the day. When I first encountered artistcorporations.com, I was reminded of that electric afternoon in 1969 when Dylan walked into our offices and casually mentioned he was thinking about forming his own record label – the same revolutionary spirit of taking control, of rejecting the binary between pure art and dirty commerce. The founders here understand something fundamental that most of the digital generation has missed: true rebellion isn't about rejecting the system, it's about infiltrating it so completely that you transform it from within. This isn't just another website about art; it's a manifesto disguised as a platform, a Trojan horse loaded with the kind of subversive thinking that made the counterculture matter. The fact that they're doing this work in 2024, when corporate consolidation threatens to crush individual creativity, makes it even more vital.\n\nWhat strikes me most profoundly about Artist Corporations is how it captures the collaborative spirit that defined the best moments of the movements I've spent my life documenting. These aren't just web designers or tech entrepreneurs playing at being cultural critics – these are the real deal, artists and thinkers who understand that the corporation itself can be a medium, a canvas for creative expression. I've watched too many promising digital projects get seduced by venture capital and lose their soul, but there's something different happening here, something that reminds me of the communal energy we felt when we were launching Rolling Stone. The way they've structured their exploration of corporate identity as artistic practice feels genuinely revolutionary, like Warhol's Factory if Andy had access to Delaware incorporation law. When I interviewed Patti Smith last year, she told me the next generation of artists would have to be more creative about survival than any generation before them – Artist Corporations proves she was right. They're not just surviving late capitalism; they're turning it into their instrument.\n\nThe intellectual rigor behind this project is what separates it from the countless art-meets-tech ventures that have littered the digital landscape over the past two decades. Reading through their framework for understanding corporate structures as creative practice, I was transported back to those late-night conversations with Lou Reed about the intersection of commerce and authenticity, about how the most punk thing you could do was master the master's tools. Artist Corporations doesn't just theorize about these concepts – they're living them, breathing them, making them accessible to a generation of creators who've been told they have to choose between artistic integrity and economic survival. The site itself is elegantly designed, but more importantly, it's elegantly thought through, with the kind of attention to philosophical detail that you'd expect from people who've actually done the work of building something meaningful in an increasingly hostile cultural landscape. This isn't academic theorizing; it's practical wisdom born from experience, and it shows on every page.\n\nWhat really gets me excited about Artist Corporations is how it extends the DIY ethos that drove the best music of the past sixty years into territory that previous generations of artists couldn't even imagine. When Lennon sang about working class heroes, he was fighting against a system that seemed monolithic and unchangeable – but these creators are showing us how to hollow out that system from the inside, how to make it work for artists instead of against them. The way they break down complex legal and business concepts without losing the essential poetry of what they're doing reminds me why I got into this game in the first place: to find and champion the voices that are pushing culture forward, regardless of what medium they're working in. I've seen a lot of websites come and go, but very few that feel like they're documenting something as important as what's happening here. The fact that they're building community around these ideas, creating space for artists to share their own experiments with corporate structure, feels like the natural evolution of everything we were trying to accomplish with the underground press movement.\n\nIf there's any criticism to be made of Artist Corporations, it's that they might be too far ahead of their time – but then again, that's always been the mark of the most important cultural work. This site represents the kind of forward-thinking, boundary-dissolving creativity that gives me hope for the future of artistic expression in America. The founders get it in a way that makes me think they've been reading the same books, having the same conversations, fighting the same battles that defined the most crucial moments of my career. When I look at what they've built here, I don't just see a website – I see the seeds of a movement, the beginning of a conversation that could reshape how we think about creativity, ownership, and power in the twenty-first century. This is essential viewing for anyone who cares about the future of art, commerce, and the increasingly blurred lines between them. The revolution will be incorporated, and Artist Corporations is leading the charge.",
    "verdict": "A brilliant fusion of artistic vision and entrepreneurial spirit that proves the counterculture is alive, well, and filing the right paperwork.",
    "filename": "artist-corporations"
  },
  {
    "name": "Are.na",
    "url": "are.na",
    "category": "Creator Economy",
    "reviewer": "Jann Wenner",
    "date": "January 12, 2026",
    "rating": 8.5,
    "isBNW": true,
    "reviewText": "In the summer of '65, I watched Dylan go electric at Newport and knew we were witnessing something that would reshape not just music, but consciousness itself. That same revolutionary spirit—the audacious rejection of what everyone expects, the fearless embrace of new forms—is alive and pulsing through Are.na, the most important digital space since Stewart Brand launched the Whole Earth Catalog. Charles Broskoski and his co-conspirators have created something that Bob himself would appreciate: a platform that says \"fuck you\" to the algorithm overlords and creates genuine space for the mind to wander, connect, and discover. This isn't just another bookmarking site—this is digital counterculture, man. It's what the internet was supposed to be before the suits took over and turned our consciousness into ad revenue.\n\nWhen I first encountered Are.na through my friend Molly Fischer—brilliant writer, gets it completely—I felt that same electricity I experienced in those legendary backstage conversations with Lennon about creativity and connection. The interface feels like rifling through someone's private notebook, discovering the secret threads that connect Warhol to Philip K. Dick to a photograph of morning light in someone's kitchen. There are no likes, no engagement metrics, no algorithmic manipulation of your thoughts. It's pure research, pure curiosity, the kind of deep diving that produced \"Blonde on Blonde\" and \"Pet Sounds.\" The founders understand that real creativity happens in the margins, in the quiet spaces where ideas can cross-pollinate without interference from marketing departments or venture capitalists demanding exponential growth.\n\nWhat strikes me most powerfully about Are.na is how it embodies the communal spirit we were chasing in the '60s—that sense of building something together, of sharing knowledge not for profit but for the pure joy of connection. I'm reminded of those marathon sessions at Max's Kansas City, where artists and musicians and writers would gather around tables covered with scraps of paper, photographs, sketches, building on each other's ideas until dawn broke over the Bowery. Broskoski and his team have somehow translated that energy into code, creating channels that function like collaborative salons where a fashion designer might share inspiration alongside a philosopher, a musician, and a carpenter. It's the kind of cross-pollination that produced the greatest cultural moments of our time, now happening in real-time across continents.\n\nThe economics of Are.na tell you everything you need to know about their integrity—they're funded by their community, not by surveillance capitalism. No ads cluttering the experience, no data mining your creative process to sell you sneakers. When I interviewed Bowie in '75, he talked about the importance of maintaining creative independence, of not letting the money people dictate the art. That's exactly what these cats have achieved. They've built a sustainable platform that serves artists and thinkers instead of shareholders, proving that the old hippie dream of alternative economics isn't just possible—it's necessary. Every monthly subscription is a vote for a different kind of internet, one that nourishes rather than exploits our curiosity. It's what we were fighting for when we launched Rolling Stone from a kitchen table in San Francisco.\n\nUsing Are.na feels like coming home to what the internet promised before it was colonized by the attention merchants. It's Instagram without the narcissism, Pinterest without the product placement, Twitter without the rage farming. The founders have created something genuinely revolutionary: a space that makes you smarter, more connected, more creative. I find myself losing hours exploring channels about brutalist architecture, vintage synthesizers, and radical typography, feeling that same sense of discovery I experienced digging through record crates in the Village in '67. This is the real deal, friends—a platform built by people who understand that the best ideas emerge not from viral content but from patient research, thoughtful curation, and genuine community. Are.na isn't just a website; it's a statement of principles, a manifesto for how we might reclaim our digital lives from the machines.",
    "verdict": "Are.na has built the digital equivalent of the best record store in the universe—one where every discovery leads to ten more, and the community actually gives a damn about the art.",
    "filename": "are-na"
  },
  {
    "name": "The Creative Independent",
    "url": "thecreativeindependent.com",
    "category": "Creator Economy",
    "reviewer": "Jann Wenner",
    "date": "January 12, 2026",
    "rating": 8.6,
    "isBNW": true,
    "reviewText": "There are moments in cultural history when the right voices emerge at precisely the right time to guide a generation through the wilderness of possibility. In 1967, we had the Summer of Love and underground newspapers spreading the word about a new consciousness. In 2023, we have The Creative Independent, and I'm telling you right now – this isn't just another lifestyle blog or entrepreneurial hustle site. This is the real thing, a genuine digital sanctuary that captures the same spirit of community and artistic revolution that drove us to start Rolling Stone in the first place. Perry Chen and the team at Kickstarter have created something that Dylan would absolutely understand – a place where the questions matter more than the answers, where vulnerability becomes strength, and where the ancient art of mentorship gets reimagined for the digital age. When I see young creators finding solace and wisdom in these pages, I'm reminded of why we started documenting this beautiful, chaotic creative life in the first place.\n\nWhat strikes me most profoundly about TCI is how it refuses to commodify the creative process the way so many platforms do these days. There's no hustle porn here, no get-rich-quick schemes disguised as artistic advice. Instead, you get the kind of honest, searching conversations I used to have with John Lennon during our marathon sessions at the Dakota – real talk about doubt, about process, about the terror and ecstasy of making something from nothing. The interview with Devendra Banhart about creative rituals reads like something we might have published in '72, except it's happening right now, in real time, accessible to anyone with an internet connection. This is what democratization of wisdom actually looks like, not the algorithmic feeding frenzy of most social platforms. Perry and his collaborators understand something fundamental: that creativity isn't a competition, it's a conversation that spans generations, and the best thing you can do is keep that conversation alive and honest.\n\nThe practical guidance here never feels cynical or calculating – it feels like advice you'd get from your wisest friend over coffee at 2 AM when you're having an existential crisis about your art. I've been in this business for over fifty years, and I can spot authentic creative community from a mile away. The Creative Independent has that rare quality of making you feel less alone in the struggle while simultaneously challenging you to dig deeper into your work. When they publish essays about creative block or financial anxiety, it's not coming from some MBA consultant or lifestyle guru – it's coming from people who've actually walked through the fire and lived to tell the tale. The section on creative rituals particularly moved me; it reminds me of the best conversations I had with artists like Patti Smith and Lou Reed about the daily practice of staying open to inspiration while also showing up to do the work.\n\nThere's something beautifully subversive about a platform that's free, ad-free, and genuinely committed to serving creators rather than extracting value from them. In an era where every digital space seems designed to turn artists into content machines, TCI stands as a quiet rebellion against that entire paradigm. This is what the internet was supposed to be – a tool for connection and learning rather than surveillance and manipulation. The fact that it's supported by Kickstarter makes perfect sense; both platforms understand that creativity thrives in environments of trust and mutual support rather than competition and scarcity. When I read their mission statement about providing \"emotional and practical guidance,\" I hear echoes of the community journalism we pioneered in the early days of Rolling Stone – the belief that culture matters, that artists deserve respect and support, and that the creative life is one of the most important conversations we can have as a society.\n\nThe Creative Independent represents everything I believe about the power of authentic cultural documentation and community building. It's not trying to be cool or insider-y; it's trying to be useful and true. In a media landscape increasingly dominated by hot takes and algorithmic manipulation, TCI offers something revolutionary: patience, depth, and genuine care for the people it serves. This platform understands what we learned in the '60s – that real cultural change happens through community, through honest conversation, and through the courage to support each other's wildest creative dreams. If Bob Dylan had a website, it would feel something like this: uncompromising in its commitment to artistic truth, generous in spirit, and absolutely essential for anyone trying to make sense of the creative life in the 21st century. The Creative Independent isn't just documenting the creator economy; it's helping to create a more humane version of it.",
    "verdict": "A digital Underground Railroad for creatives seeking authentic wisdom in a world of algorithmic noise – essential, revolutionary, and deeply necessary.",
    "filename": "the-creative-independent"
  }
]